// pages/catalog.tsx

'use client'
export default function userAgreementCatalog() {

    return (


          <div className="user-agreement">
            <h1>Пользовательское соглашение онлайн сервиса по продаже билетов на Гонки Дронов</h1>
      
            <section>
              <h2>1. Общие положения</h2>
              <p><strong>1.1.</strong> Настоящее Пользовательское соглашение (далее - Соглашение) регулирует отношения между пользователем (далее - Пользователь) и онлайн-сервисом по продаже билетов на Гонки Дронов (далее - Сервис).</p>
              <p><strong>1.2.</strong> Пользователь обязан ознакомиться с условиями Соглашения перед использованием Сервиса. Использование Сервиса означает согласие Пользователя с условиями Соглашения.</p>
            </section>
      
            <section>
              <h2>2. Услуги</h2>
              <p><strong>2.1.</strong> Сервис предоставляет услуги по продаже билетов на спортивные мероприятия, связанные с Гонками Дронов.</p>
              <p><strong>2.2.</strong> Все заказы обрабатываются в порядке очереди, в зависимости от наличия доступных мест на мероприятие.</p>
            </section>
      
            <section>
              <h2>3. Информация о мероприятиях</h2>
              <p><strong>3.1.</strong> Сервис предоставляет актуальную информацию о дате, времени и месте проведения гонок дронов.</p>
              <p><strong>3.2.</strong> Пользователь обязуется самостоятельно следить за изменениями в расписании мероприятий, которые могут быть внесены организаторами.</p>
            </section>
      
            <section>
              <h2>4. Качество предоставляемых услуг</h2>
              <p><strong>4.1.</strong> Сервис гарантирует предоставление корректной информации о мероприятии и наличии билетов.</p>
              <p><strong>4.2.</strong> В случае отмены или переноса мероприятия, Пользователь будет уведомлен через контактные данные, указанные при оформлении заказа.</p>
            </section>
      
            <section>
              <h2>5. Возврат и обмен билетов</h2>
              <p><strong>5.1.</strong> Возврат билетов возможен только в случае отмены или переноса мероприятия по инициативе организаторов.</p>
              <p><strong>5.2.</strong> В случае возврата средств за билет, Пользователь обязан связаться с поддержкой Сервиса и предоставить необходимые данные для обработки возврата.</p>
            </section>
      
            <section>
              <h2>6. Оплата</h2>
              <p><strong>6.1.</strong> Оплата билетов осуществляется через доступные на сайте способы.</p>
              <p><strong>6.2.</strong> Заказ считается подтвержденным после поступления оплаты на счет Сервиса.</p>
            </section>
      
            <section>
              <h2>7. Конфиденциальность</h2>
              <p><strong>7.1.</strong> Сервис обязуется не разглашать личные данные Пользователя третьим лицам без его согласия.</p>
              <p><strong>7.2.</strong> Личные данные используются исключительно для оформления заказа и предоставления информации о мероприятии.</p>
            </section>
      
            <section>
              <h2>8. Ответственность сторон</h2>
              <p><strong>8.1.</strong> Сервис не несет ответственности за отмену или перенос мероприятия, так как это находится в компетенции организаторов.</p>
              <p><strong>8.2.</strong> Пользователь несет ответственность за предоставление корректной информации при оформлении заказа.</p>
            </section>
      
            <section>
              <h2>9. Доставка электронных билетов</h2>
              <p><strong>9.1.</strong> Электронные билеты доставляются на указанный Пользователем адрес электронной почты после подтверждения оплаты.</p>
              <p><strong>9.2.</strong> Пользователь обязан проверить корректность введенного адреса электронной почты при оформлении заказа.</p>
            </section>
      
            <section>
              <h2>10. Прочие условия</h2>
              <p><strong>10.1.</strong> Все споры и разногласия, возникающие из-за использования Сервиса, решаются путем переговоров между сторонами.</p>
              <p><strong>10.2.</strong> В случае невозможности урегулирования споров путем переговоров, они подлежат рассмотрению в соответствии с действующим законодательством.</p>
          </section>
          </div>
    )
}
